src/Enums/СтатусыГруппыДоставки/СтатусыГруппыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыГруппыДоставки</name>
  <enumValues>
    <name>waitForOrders</name>
  </enumValues>
  <enumValues>
    <name>waitForDelay</name>
  </enumValues>
  <enumValues>
    <name>waitForPayment</name>
  </enumValues>
  <enumValues>
    <name>shipment</name>
  </enumValues>
  <enumValues>
    <name>finished</name>
  </enumValues>
  <enumValues>
    <name>empty</name>
  </enumValues>
  <enumValues>
    <name>waitForDistributor</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыСтикеров/ВидыСтикеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСтикеров</name>
  <enumValues>
    <name>ГС</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТК</name>
  </enumValues>
  <enumValues>
    <name>ГруппаДоставки</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ТочкиРаздачи/ТочкиРаздачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиРаздачи</name>
  <predefined>
    <items>
      <name>ТочкаНеОпределена</name>
      <description>Точка не определена</description>
    </items>
  </predefined>
  <attributes>
    <name>Габарит</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КРазбору</name>
    <comment>На эту точку разбираем все коробки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГородаОтправителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АккаунтДляОбменаСТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольДляОбменаСТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДляТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПродавцаДляТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортТК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КвитанцииТКпуть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Майл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородСП</name>
    <type>
      <types>CatalogRef.ГородаСП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифПВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифПВнп</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Процент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузкиПосылки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/СП_ГруппыДоставки1/Module.bsl
Функция ГруппаДоставки_Из_Api(стр) Экспорт
	КодКоробки	= "гд_" + Формат(Число(стр.id), "ЧЦ=11; ЧВН=; ЧГ=0");
	Если стр.orders.order.Количество() = 0 Тогда
		СтатусГруппыДоставки	= Перечисления.СтатусыГруппыДоставки.empty;
	Иначе
		СтатусГруппыДоставки	= Перечисления.СтатусыГруппыДоставки[стр.status];
	КонецЕсли;
	параметрыКоробки	= Новый Структура;
	параметрыКоробки.Вставить("ВидСтикера", 				Перечисления.ВидыСтикеров.ГруппаДоставки);
	параметрыКоробки.Вставить("СтатусГруппыДоставки", 		СтатусГруппыДоставки);
	параметрыКоробки.Вставить("ТочкаСбора", 				СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(стр.distributor_code));
	параметрыКоробки.Вставить("ТочкаНазначения", 			?(	стр.recipient_code = "",
																Справочники.ТочкиРаздачи.ТочкаНеОпределена, 
																СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(стр.recipient_code)));
	параметрыКоробки.Вставить("УчастникГД", 				СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(стр.uid));
	параметрыКоробки.Вставить("МинДатаДоставки", 			СтоСПОбмен_Общий.ДатаИзСтроки(стр.min_delivery_date));
	параметрыКоробки.Вставить("МаксДатаДоставки", 			СтоСПОбмен_Общий.ДатаИзСтроки(стр.max_delivery_date));
	параметрыКоробки.Вставить("СрокХраненияГруппы", 		стр.date_range_limit);
	параметрыКоробки.Вставить("ДатаЗагрузки", 				СтоСПОбмен_Общий.ДатаИзСтроки(стр.created_at));
	параметрыКоробки.Вставить("ДатаМодификации", 			СтоСПОбмен_Общий.ДатаИзСтроки(стр.updated_at));
	параметрыКоробки.Вставить("МетодОплаты", 				?(	стр.payment_method = "", 
																Перечисления.МетодыОплаты.ПустаяСсылка(),
																Перечисления.МетодыОплаты[стр.payment_method]));
	параметрыКоробки.Вставить("ДатаЗагрузки", 				СтоСПОбмен_Общий.ДатаИзСтроки(стр.created_at));
	параметрыКоробки.Вставить("Состав", 					стр.orders);
	параметрыКоробки.Вставить("Догрузить", 					Ложь);

	стр.Ссылка			= СП_РаботаСоСправочниками.ПолучитьКоробкуПо_Коду(КодКоробки);
	СП_РаботаСоСправочниками.ОбновитьКоробку(стр.Ссылка, параметрыКоробки);

КонецФункции
